tap "d12frosted/emacs-plus"
tap "dunn/emacs"
tap "go-delve/delve"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/emacs"
tap "homebrew/fuse"
tap "homebrew/python"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "jesseduffield/lazygit"
tap "joshuaclayton/formulae"
tap "martido/brew-graph"
tap "mpv-player/mpv"
tap "pivotal/tap"
tap "railwaycat/emacsmacport"
tap "simeji/jid"
cask "osxfuse"
# Search tool like grep, but optimized for programmers
brew "ack"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Java build tool
brew "ant"
# Engine for large-scale data processing
brew "apache-spark"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Cross-platform C++ Library for asynchronous programming
brew "asio"
# Spell checker with better logic than ispell
brew "aspell"
# Archival front-end
brew "atool"
# Configuration editing tool and API
brew "augeas"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# General-purpose data compression with high compression ratio
brew "xz"
# Virtual file system that facilitates looking inside archives
brew "avfs"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db@4"
# Parser generator
brew "bison"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Navigation scripting and testing tool for PhantomJS
brew "casperjs"
# Create Chinese calendars for print or browsing
brew "ccal"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU multiple precision arithmetic library
brew "gmp"
# Asynchronous event library
brew "libevent"
# YAML Parser
brew "libyaml"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Reimplementation of ctags(1)
brew "ctags"
# Tool to perform numerical, textual & statistical operations
brew "datamash"
# Digital camera RAW photo decoding software
brew "dcraw"
# Debugger for the Go programming language.
brew "delve"
# Local webserver for developers
brew "devd"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# Convert ASCII diagrams into proper bitmap graphics
brew "ditaa"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# C++ template library for linear algebra
brew "eigen"
# Distributed search & analytics engine
brew "elasticsearch"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Functional programming language for building browser-based GUIs
brew "elm"
# C string library for manipulating Unicode strings
brew "libunistring"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Run arbitrary commands when files change
brew "entr"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# File harvester to ship log files to Elasticsearch or Logstash
brew "filebeat"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Library for processing command-line flags
brew "gflags"
# Interpreter for PostScript and PDF
brew "ghostscript", link: false
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Library for USB device access
brew "libusb"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Source code tag system
brew "global"
# Application-level logging library
brew "glog"
# MIME mail utilities
brew "gmime"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# The Haskell Tool Stack
brew "haskell-stack"
# Program providing model for GNU coding standards and practices
brew "hello"
# Automatically generate simple man pages
brew "help2man"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Secure Markdown processing (a revived fork of Sundown)
brew "hoedown"
# Advanced HTML-to-text converter
brew "html2text"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Display an interface's bandwidth usage
brew "iftop"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# Load testing and performance measurement application
brew "jmeter"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Analytics and search dashboard for Elasticsearch
brew "kibana"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Build tool for Clojure
brew "leiningen"
# Image processing and image analysis library
brew "leptonica"
# Input filter for the pager less
brew "lesspipe", args: ["with-syntax-highlighting"]
# Sophisticated file transfer program
brew "lftp"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Implementation of the file(1) command
brew "libmagic"
# Portable library for network traffic capture
brew "libpcap"
# Extremely Fast Compression algorithm
brew "lz4"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Library to render SVG files using Cairo
brew "librsvg"
# Library for USB device access
brew "libusb-compat"
# VisualOn AAC encoder library
brew "libvo-aacenc"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Version 1 of the Little CMS library
brew "little-cms"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Tool for managing events and logs
brew "logstash"
# Swiss Army Knife for macOS
brew "m-cli"
# Creates dependencies in makefiles
brew "makedepend"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Uniform interface to a large number of hash algorithms
brew "mhash"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# UPnP IGD client library and daemon
brew "miniupnpc"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# MP3 player for Linux and UNIX
brew "mpg123"
# UNIX movie player
brew "mplayer"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# C++ search engine library with many bindings
brew "xapian"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu", args: ["HEAD", "with-emacs"]
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# Package for scientific computing with Python
brew "numpy"
# Synchronizes emails between two repositories
brew "offlineimap"
# High dynamic-range image file format
brew "openexr"
# Open source computer vision library
brew "opencv"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Forensic toolkit
brew "sleuthkit"
# Framework for scalable cross-language services development
brew "thrift"
# Malware identification and classification tool
brew "yara"
# SQL powered operating system instrumentation and analytics
brew "osquery"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Advanced filtering web proxy
brew "privoxy"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Treat text as a database
brew "q"
# QR Code generation
brew "qrencode"
# Messaging broker
brew "rabbitmq"
# Perl 6 compiler
brew "rakudo-star"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Libev port of shadowsocks
brew "shadowsocks-libev"
# Database of common MIME types
brew "shared-mime-info"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Fast and powerful open source alternative to grep
brew "sift"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# SSTP (Microsofts Remote Access Solution for PPP over SSL) client
brew "sstp-client"
# Process Control System
brew "supervisor"
# System-level exploration and troubleshooting tool
brew "sysdig"
# TCP connect to the given IP/port combo
brew "tcping"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat@7"
# Command-line translator using Google Translate and more
brew "translate-shell"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terminal interaction recorder and player
brew "ttyrec"
# Converts a ttyrec file into gif files
brew "ttygif"
# Tools for working with Lightbend Reactive Platform
brew "typesafe-activator"
# Unidentified Flying RAW: RAW image processing utility
brew "ufraw"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# URL extractor/launcher
brew "urlview"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Ncurses based file manager with vi like keybindings
brew "vifm"
# Use ViM as PAGER
brew "vimpager"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# HTTP server for purely static content
brew "webfs"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# JavaScript package manager
brew "yarn", link: false
# Modular BSD reimplementation of NASM
brew "yasm"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Suite of barcodes-reading tools
brew "zbar"
# High-performance, asynchronous messaging library
brew "zeromq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Debugger for zsh
brew "zshdb"
# Easily let-bind values of an assoc-list by their names
brew "homebrew/emacs/let-alist"
# Extended tabulated-list-mode for Emacs
brew "homebrew/emacs/tablist"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# A command line tool to identify unused code.
brew "joshuaclayton/formulae/unused"
brew "martido/brew-graph/brew-graph"
brew "pivotal/tap/springboot"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-natural-title-bar", "with-spacemacs-icon"]
# jid
brew "simeji/jid/jid"
cask "aria2gui"
cask "betterzipql"
cask "calibre"
cask "dnscrypt"
cask "docker"
cask "electronic-wechat"
cask "gpgtools"
cask "kindlegen"
cask "launchrocket"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "vagrant"
cask "virtualbox"
cask "webpquicklook"
mas "1Password", id: 443987910
mas "BestTrace", id: 1037779758
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Eicon", id: 590211747
mas "Eudb_en_free", id: 434350458
mas "Gapplin", id: 768053424
mas "GeoPhotos", id: 1136088196
mas "GIF Brewery 3", id: 1081413713
mas "GrabIt", id: 450166997
mas "HanzConvert", id: 442107196
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Maipo", id: 789066512
mas "Mate Translate", id: 1005088137
mas "Microsoft Remote Desktop", id: 715768417
mas "One", id: 941552500
mas "Reeder", id: 880001334
mas "Sip", id: 507257563
mas "SQLPro for Postgres", id: 976140091
mas "SQLPro for SQLite", id: 586001240
mas "Telegram", id: 747648890
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 409789998
mas "Typeeto", id: 970502923
mas "Unsplash Wallpapers", id: 1284863847
mas "VPN Plus", id: 1202726435
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
mas "网易有道词典", id: 491854842
mas "订票助手", id: 1163682213
